#部署登録以下
[
    ['1', '未所属','一般部員'],
    ['2', '競技・進行部','一般部員'],
    ['3', '庶務・表彰部','一般部員'],
    ['4', '会場・管理部','一般部員'],
    ['5', '競技・進行部','企画責任者'],
    ['6', '競技・進行部','統括補佐'],
    ['7', '庶務・表彰部','統括補佐'],
    ['8', '会場・管理部','統括補佐'],
    ['9', '競技・進行部','統括'],
    ['10', '庶務・表彰部','統括'],
    ['11', '会場・管理部','統括'],
    ['12', '競技・進行部','副部長'],
    ['13', '庶務・表彰部','副部長'],
    ['14', '会場・管理部','副部長'],
    ['15', '競技・進行部','部長'],
    ['16', '庶務・表彰部','部長'],
    ['17', '会場・管理部','部長'],
    ['18', 'CP部','統括補佐'],
    ['19', 'CP部','統括'],
    ['20', 'CP部','副部長'],
    ['21', 'CP部','部長'],
    ['22', '人事部','補佐'],
    ['23', '会計部','補佐'],
    ['24', '広報部','補佐'],
    ['25', 'システム部','補佐'],
    ['26', '本部','補佐'],
    ['27', '人事部','一般部員'],
    ['28', '人事部','副部長'],
    ['29', '人事部','部長'],
    ['30', '会計部','一般部員'],
    ['31', '会計部','副部長'],
    ['32', '会計部','部長'],
    ['33', '広報部','一般部員'],
    ['34', '広報部','副部長'],
    ['35', '広報部','部長'],
    ['36', 'システム部','一般部員'],
    ['37', 'システム部','副部長'],
    ['38', 'システム部','部長'],
    ['39', ' ','副代表'],
    ['40', ' ','代表'],
    ['41', '教職員','行事担当'],
    ['42', '教育学生支援部','ACT担当'],
    ['43', '教職員','顧問'],
    ['44', '教職員','IT管理者'],
    ['45', '未所属','当日ボランティア'],
    ['46', '東京工科大学','かまた祭実行委員会（大学）'],
    ['47', '業務委託','管理者']

].each do | id, department, position|
Department.create!(
{ id: id, department: department, position: position}
)
end
#
#権限登録以下
[
    ['1', '2100000'],
    ['2', '2100000'],
    ['3', '2100000'],
    ['4', '2100000'],
    ['5', '2100000'],
    ['6', '2220000'],
    ['7', '2220000'],
    ['8', '2220000'],
    ['9', '2220000'],
    ['10', '2220000'],
    ['11', '2220000'],
    ['12', '2330000'],
    ['13', '2330000'],
    ['14', '2330000'],
    ['15', '2340000'],
    ['16', '2340000'],
    ['17', '2340000'],
    ['18', '2220000'],
    ['19', '2220000'],
    ['20', '2330000'],
    ['21', '2340000'],
    ['22', '2440000'],
    ['23', '2432100'],
    ['24', '2420000'],
    ['25', '2430020'],
    ['26', '2442100'],
    ['27', '2550000'],
    ['28', '2560000'],
    ['29', '2560000'],
    ['30', '2533100'],
    ['31', '2544100'],
    ['32', '2545100'],
    ['33', '2530100'],
    ['34', '2540000'],
    ['35', '2540000'],
    ['36', '2530030'],
    ['37', '2540041'],
    ['38', '2540041'],
    ['39', '2550110'],
    ['40', '2555110'],
    ['41', '3042001'],
    ['42', '3055141'],
    ['43', '3055141'],
    ['44', '4055161'],
    ['45', '1000001'],
    ['46', '1000001'],
    ['47', '4055161']

].each do | department_id, code|
Role.create!(
{ department_id: department_id, code: code}
)
end
#カレッジ登録用
[
["1","管理者","Z"],
["2","クリエイターズ","A"],
["3","デザイン","G"],
["4","ミュージック","B"],
["5","IT","C"],
["6","テクノロジー","D"]
].each do |id, name, flag|
College.create!(
{ id: id, name: name, flag: flag}
)
end
#学科情報登録用
[
["1","1","特権","ZZ","0"],
["2","2","放送芸術科","BD","2"],
["3","2","声優・演劇科","AD","2"],
["4","2","演劇スタッフ","AS","2"],
["5","2","マンガ・アニメーション科4年","LA","4"],
["6","2","マンガ・アニメーション科2年","SA","2"],
["7","3","ゲームクリエイター科4年","L4","4"],
["8","3","ゲームクリエイター科","GS","2"],
["9","3","CG映像科","CG","3"],
["10","3","デザイン科","MA","3"],
["11","4","ミュージックアーティスト科","MU","2"],
["12","4","コンサート・イベント科","CE","2"],
["13","4","音響芸術科","MD","2"],
["14","4","ダンスパフォーマンス科","DP","2"],
["15","5","ITスペシャリスト科","IS","4"],
["16","5","AIシステム科","AI","2"],
["17","5","情報処理科","CD","2"],
["18","5","ネットワーク・セキュリティ科","NT","2"],
["19","5","情報ビジネス科","J2","2"],
["20","6","電子・電気科","E2","2"],
["21","6","建築学科","U4","4"],
["22","6","建築設計科","UB","2"],
["23","6","機械設計科","ID","2"]
].each do |id, college_id, name, symbol, year|
Course.create!(
{ id: id, college_id: college_id, name: name, symbol: symbol, year: year }
)
end
